{"_id": 1065302, "num": 0, "text": "why do pandas live"}
{"_id": 1065302, "num": 1, "text": "Why do pandas live in specific habitats, particularly in bamboo-rich forests in mountainous regions of central and southeastern China, such as Sichuan, Shaanxi, and Gansu provinces, and what are the unique adaptations and specifications that allow them to thrive in these environments, despite challenges like habitat loss due to deforestation and human encroachment?"}
{"_id": 1065302, "num": 2, "text": "Where do pandas live, and what are the specific habitat requirements for their survival? How has human activity, such as deforestation and hunting, impacted their habitats and contributed to their endangered status? Additionally, what is the composition of their diet, and how has this influenced their behavior and lifestyle?"}
{"_id": 1065302, "num": 3, "text": "Why do pandas live in specific habitats, particularly in the bamboo forests of central and southeastern China, and what unique adaptations and dietary needs do they have that make these areas suitable for them?"}
{"_id": 1065302, "num": 4, "text": "Why do pandas primarily live in the bamboo forests found in the mountainous regions of central and southeastern China, specifically in isolated areas of Sichuan, Shaanxi, and Gansu provinces, where the climate includes torrential rains, dense mists, and heavy cloud cover? What adaptations have allowed them to thrive in these environments, and how does their diet, which consists of more than 90% bamboo, influence their habitat preferences and behaviors?"}
{"_id": 1065302, "num": 5, "text": "Why do pandas live in bamboo forests in central and southeastern China, specifically in mountain areas with dense bamboo understories in provinces like Sichuan, Shaanxi, and Gansu? How do these habitats affected by factors such as torrential rains, dense mists, and heavy cloud cover, suit their specialized diet consisting mainly of bamboo?"}
{"_id": 1065302, "num": 6, "text": "Why do pandas specifically live in the mountainous regions of central and southeastern China, particularly in bamboo forests? What adaptations do they have to survive in these environments, and how has their habitat been affected by human activities?"}
{"_id": 1065302, "num": 7, "text": "Why do pandas live in the mountainous regions of central and southeastern China, specifically in the temperate forests of Sichuan, Shaanxi, and Gansu provinces, where they have access to dense bamboo forests that provide 99% of their diet, despite human activities such as deforestation and encroachment that have endangered their habitats?"}
{"_id": 1065302, "num": 8, "text": "Why do pandas specifically live in the mountainous regions of central and southeastern China, such as the bamboo forests in Sichuan, Shaanxi, and Gansu provinces, and what adaptations have they developed to thrive in these environments, including their specialized diet primarily consisting of bamboo?"}
{"_id": 1065302, "num": 9, "text": "Why do pandas live in the mountainous bamboo forests of certain regions in China, and what specific characteristics and adaptations make these areas suitable for their survival, considering their diet and behavior?"}
{"_id": 1065302, "num": 10, "text": "Where do pandas live, and what are the specific habitats and environments that support their survival?"}